app/View/Components/CategoryDropdown.php

    public function render()
    {
        return view('components.category-dropdown',[
            'categories'=>Category::all(),
            'current_category' => Category::firstWhere('slug',request('category'))
        ]);
---
SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'minima-suscipit-sapiente-magni-non-omnis-quo-facilis' LIMIT 1