app/Http/Controllers/AdminPostController.php

    public function index(){
        return view('admin.posts.index', [
            'posts' => Post::paginate(5)
        ]);
---
SELECT * FROM `posts` LIMIT 5 offset 15
SELECT count(*) as aggregate FROM `posts`

    public function update(Post $post){
        $attributes = $this->validatePost($post);
        if($attributes['thumbnail'] ?? false){
            $attributes['thumbnail'] = request()->file('thumbnail')->store('thumbnails');
        }
        $post->update($attributes);
---
UPDATE `posts` SET `title` = 'latest form puspa joshi', `posts`.`updated_at` = '2023-07-29 07:31:15' WHERE `id` = 18

    public function destroy(Post $post){
        $post->delete();
---
DELETE FROM `posts` WHERE `id` = 12