app/Http/Controllers/PostCommentController.php

    public function store(Post $post)
    {
        request()->validate([
            'body' => 'required'
        ]);
        $post->comments()->create([
            'user_id' => request()->user()->id,
            'body' =>request('body')
        ]);
---
INSERT INTO `comments` (`user_id`, `body`, `post_id`, `updated_at`, `created_at`) VALUES (4, 'hello pusp i am here', 12, '2023-07-25 10:55:59', '2023-07-25 10:55:59')