app/Http/Controllers/RegisterController.php

    public function store(){
     $attributes = request()->validate([
            'name' =>'required|max:255',
            'username' => 'required|max:255|min:3|unique:users,username',
            'email' => 'required|email|unique:users,email',
            'password' => 'required|min:7|max:255'
        ]);
        $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('edevpuspa@gmail.com', 'edevpuspa@gmail.com', 'edevpuspa@gmail.com', '$2y$10$mdIrL/Q1q63VjT9KC5scruwsc2Zkta.xOUGgVRqdkI8CGMWd9H9qC', '2023-07-25 13:28:19', '2023-07-25 13:28:19')